cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x7_SVD.xml
				<register>
					<name>DBGCONTROL</name>
					<description>Debug Control</description>
					<addressOffset>0xd0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXDBGHEN</name>
							<description>I2S Transmit DMA Debug Halt Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Transmit DMA requests continue while the core is debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Transmit DMA requests stop while the core is debug mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXDBGHEN</name>
							<description>I2S Receive DMA Debug Halt Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Receive DMA requests continue while the core is debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Receive DMA requests stop while the core is debug mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXDBGMD</name>
							<description>I2S Transmit Debug Mode. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The clock to the I2S transmitter is active in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>The clock to the I2S transmitter is not active in debug mode. The clock divider keeps running and the clock will be disabled when two samples are ready to be sent by the transmitter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXDBGMD</name>
							<description>I2S Receive Debug Mode. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The clock to the I2S receiver is active in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>The clock to the I2S receiver is not active in debug mode. The clock divider keeps running and the clock will be disabled when two samples are captured in the receiver.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>IDAC_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>IDAC</groupName>
			<baseAddress>0x40031000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>IDAC0_IRQn</name>
				<value>48</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000007</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>OUPDT</name>
							<description>Output Update Trigger. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DACNT8</name>
									<description>The IDAC output updates using the DACnT8 (Timer 0 Low Overflow) trigger source.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT9</name>
									<description>The IDAC output updates using the DACnT9 (Timer 1 High Overflow) trigger source.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT10</name>
									<description>The IDAC output updates using the DACnT10 (Timer 1 Low Overflow) trigger source.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT11</name>
									<description>The IDAC output updates using the DACnT11 (Timer 1 High Overflow) trigger source.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT12</name>
									<description>The IDAC output updates on the rising edge of the trigger source selected by ETRIG.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT13</name>
									<description>The IDAC output updates on the falling edge of the trigger source selected by ETRIG.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT14</name>
									<description>The IDAC output updates on any edge of the trigger source selected by ETRIG.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT15</name>
									<description>The IDAC output updates on write to DATA register (On Demand).</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ETRIG</name>
							<description>Edge Trigger Source Select. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DACNT0</name>
									<description>Select DACnT0 (PB3.2) as the IDAC external trigger source.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT1</name>
									<description>Select DACnT1 (PB3.3) as the IDAC external trigger source.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT2</name>
									<description>Select DACnT2 (PB3.5) as the IDAC external trigger source.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT3</name>
									<description>Select DACnT3 (PB3.6) as the IDAC external trigger source.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT4</name>
									<description>Select DACnT4 (PB3.7) as the IDAC external trigger source.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT5</name>
									<description>Select DACnT5 (PB3.8) as the IDAC external trigger source.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT6</name>
									<description>Select DACnT6 (PB3.9) as the IDAC external trigger source.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DACNT7</name>
									<description>Select DACnT7 (SSG0 EX2) as the IDAC external trigger source.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUTMD</name>
							<description>Output Mode. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>0P5_MA</name>
									<description>The full-scale output current is 0.5 mA.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_MA</name>
									<description>The full-scale output current is 1 mA.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_MA</name>
									<description>The full-scale output current is 2 mA.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INFMT</name>
							<description>Data Input Format. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_10_BIT</name>
									<description>Writes are interpreted as one 10-bit sample.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_10_BIT</name>
									<description>Writes are interpreted as two 10-bit samples.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_8_BIT</name>
									<description>Writes are interpreted as four 8-bit samples.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMARUN</name>
							<description>DMA Run. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Read: No DMA operations are occurring or the DMA is done. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Read: A DMA operation is currently in progress. Write: Start a DMA operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>JSEL</name>
							<description>Data Justification Select. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RIGHT</name>
									<description>Data is right-justified.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEFT</name>
									<description>Data is left-justified.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFRESET</name>
							<description>Data Buffer Reset. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RESET</name>
									<description>Initiate a data buffer reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIGINH</name>
							<description>Trigger Source Inhibit. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>The selected trigger source will cause the IDAC output to update.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The selected trigger source will not update the IDAC output, except for On-Demand DATA writes.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRAPEN</name>
							<description>Wrap Mode Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The IDAC will not wrap when it reaches the end of the data buffer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The IDAC will cycle through the data buffer contents.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ORIEN</name>
							<description>FIFO Overrun Interrupt Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the FIFO overrun interrupt (ORI).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the FIFO overrun interrupt (ORI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>URIEN</name>
							<description>FIFO Underrun Interrupt Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the FIFO underrun interrupt (URI).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the FIFO underrun interrupt (URI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WEIEN</name>
							<description>FIFO Went Empty Interrupt Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the FIFO went empty interrupt (WEI).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the FIFO went empty interrupt (WEI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>IDAC Debug Mode. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The IDAC module will continue to operate while the core is halted in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the IDAC module to halt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOADEN</name>
							<description>Load Resistor Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the internal load resistor.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the internal load resistor.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDACEN</name>
							<description>IDAC Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the IDAC.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the IDAC.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>Output Data</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Output Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BUFSTATUS</name>
					<description>FIFO Buffer Status</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LEVEL</name>
							<description>FIFO Level. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>The data FIFO is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1WORD</name>
									<description>The data FIFO contains one word.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2WORDS</name>
									<description>The data FIFO contains two words.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3WORDS</name>
									<description>The data FIFO contains three words.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4WORDS</name>
									<description>The data FIFO is full and contains four words.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ORI</name>
							<description>FIFO Overrun Interrupt Flag. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A FIFO overrun has not occurred. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: A FIFO overrun occurred. Write: Force a FIFO overrun interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>URI</name>
							<description>FIFO Underrun Interrupt Flag. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A FIFO underrun has not occurred. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: A FIFO underrun occurred. Write: Force a FIFO underrun interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WEI</name>
							<description>FIFO Went Empty Interrupt Flag. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A FIFO went empty condition has not occurred. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: The FIFO is empty. Write: Force a FIFO went empty interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUFFER10</name>
					<description>FIFO Buffer Entries 0 and 1</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BUFFER0</name>
							<description>FIFO Buffer Entry 0. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BUFFER1</name>
							<description>FIFO Buffer Entry 1. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUFFER32</name>
					<description>FIFO Buffer Entries 2 and 3</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BUFFER2</name>
							<description>FIFO Buffer Entry 2. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BUFFER3</name>
							<description>FIFO Buffer Entry 3. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINADJ</name>
					<description>Output Current Gain Adjust</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x0000000D</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GAINADJ</name>
							<description>Output Current Gain Adjust. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
