cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x7_SVD.xml
				<register>
					<name>CONFIG</name>
					<description>Module Configuration</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RFRQIEN</name>
							<description>Receive FIFO Read Request Interrupt Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the receive FIFO request interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the receive FIFO request interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RFORIEN</name>
							<description>Receive FIFO Overrun Interrupt Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the receive FIFO overrun interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the receive FIFO overrun interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TFRQIEN</name>
							<description>Transmit FIFO Write Request Interrupt Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the transmit FIFO data request interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the transmit FIFO data request interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TFORIEN</name>
							<description>Transmit FIFO Overrun Interrupt Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the transmit FIFO overrun interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the transmit FIFO overrun interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVSELIEN</name>
							<description>Slave Selected Interrupt Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the slave select interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the slave select interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MDFIEN</name>
							<description>Mode Fault Interrupt Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the mode fault interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the mode fault interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>URIEN</name>
							<description>Underrun Interrupt Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the underrun interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the underrun interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SREIEN</name>
							<description>Shift Register Empty Interrupt Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the shift register empty interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the shift register empty interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPIEN</name>
							<description>SPI Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the SPI.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the SPI.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTEN</name>
							<description>Master Mode Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Operate in slave mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Operate in master mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKPOL</name>
							<description>SPI Clock Polarity. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>The SCK line is low in the idle state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>The SCK line is high in the idle state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKPHA</name>
							<description>SPI Clock Phase. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CENTER</name>
									<description>The first edge of SCK is the sample edge (center of data bit).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE</name>
									<description>The first edge of SCK is the shift edge (edge of data bit).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NSSPOL</name>
							<description>Slave Select Polarity Select. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>NSS is active low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>NSS is active high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DDIRSEL</name>
							<description>Data Direction Select. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MSB_FIRST</name>
									<description>Data will be shifted MSB first.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LSB_FIRST</name>
									<description>Data will be shifted LSB first.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NSSMD</name>
							<description>Slave Select Mode. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>3_WIRE_MASTER_SLAVE</name>
									<description>3-wire Slave or 3-wire Master.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_WIRE_SLAVE</name>
									<description>4-wire slave (NSS input).  This setting can also be used for multi-master configurations.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_WIRE_MASTER_NSS_LOW</name>
									<description>4-wire master with NSS low (NSS output).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_WIRE_MASTER_NSS_HIGH</name>
									<description>4-wire master with NSS high (NSS output).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RFTH</name>
							<description>Receive FIFO Threshold. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONE</name>
									<description>A DMA / RFRQ request asserts when &gt;= 1 FIFO slot is filled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>A DMA / RFRQ request asserts when &gt;= 2 FIFO slots are filled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOUR</name>
									<description>A DMA / RFRQ request asserts when &gt;= 4 FIFO slots are filled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>A DMA / RFRQ request asserts when all FIFO slots are filled.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TFTH</name>
							<description>Transmit FIFO Threshold. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONE</name>
									<description>A DMA / TFRQ request asserts when &gt;= 1 FIFO slot is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>A DMA / TFRQ request asserts when &gt;= 2 FIFO slots are empty.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOUR</name>
									<description>A DMA / TFRQ request asserts when &gt;= 4 FIFO slots are empty.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>A DMA / TFRQ request asserts when all FIFO slots are empty.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSIZE</name>
							<description>Data Size. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMA Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable DMA requests. </description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable DMA requests when the transmit buffer is empty or the receive buffer is full.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RFIFOFL</name>
							<description>Receive FIFO Flush. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Flush the receive FIFO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TFIFOFL</name>
							<description>Transmit FIFO Flush. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Flush the transmit FIFO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET</name>
							<description>Module Soft Reset. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>SPI module is not in soft reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>SPI module is in soft reset and some of the module bits cannot be accessed until this bit is cleared to 0 by hardware.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKRATE</name>
					<description>Module Clock Rate Control</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKDIV</name>
							<description>Clock Divider. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FSTATUS</name>
					<description>FIFO Status</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RFRPTR</name>
							<description>Receive FIFO Read Pointer. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RFWPTR</name>
							<description>Receive FIFO Write Pointer. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TFRPTR</name>
							<description>Transmit FIFO Read Pointer. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TFWPTR</name>
							<description>Transmit FIFO Write Pointer. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
